Repository: castoretpollux/matcha
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: You must provide a file or text
fr: Vous devez fournir un fichier ou un texte

source: Method must be POST
fr: La méthode doit être POST

source: Method must be either POST or GET
fr: La méthode doit être soit POST soit GET

source: query and namespace must be specified
fr: query et namespace doivent être spécifiés

source: Document imported
fr: Document importé

source: url and namespace must be provided
fr: url et namespace doivent être fournis

source: Crawled website and transformed content to document
fr: Site web crawlé et contenu transformé en document

source: search aggregate result: %s
fr: résultat d'aggrégation de la recherche : %s

source: Overlap must be smaller than chunk size
fr: L'overlap doit être inférieur à la taille de chunk

source: Generates a concise english summary of the following text in up to 50 words, gives the summary directly, do not add a commentary or introduction:
fr: Génère un résumé concis en français de 50 mots au maximum, donne le résumé directement, n'ajoute pas un commentaire, n'ajoute pas d'introduction :
