Repository: castoretpollux/matcha
Catalog: machinery/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Generate text using %s
fr: Génération de texte via %s

source: This pipeline will use model %s and Ollama to generate some text
fr: Ce pipeline utilisera le modèle %s et Ollama pour générer un texte

source: Generate image WITH %s
fr: Générer une image avec %s

source: This pipeline will use model %s and Replicate to generate some things
fr: Ce pipeline utilisera le modèle %s et Replicate pour générer des contenus

source: Generate image from text
fr: Générer une image à partir de texte

source: Generate image from text using stable diffusion
fr: Générer une image à partir de texte en utilisant Stable Diffusion

source: Stable diffusion generation
fr: Génération Stable Diffusion

source: Starting StableDiffusion
fr: Démarrage de Stable Diffusion

source: LLM Model
fr: Modèle LLM

source: label
fr: libellé

source: label of your pipeline
fr: libellé de votre pipeline

source: description of your pipeline
fr: description de votre pipeline

source: generate description
fr: génerer une description

source: Generate Media ?
fr: Génération de media ?

source: Input kind
fr: Type d'entrée

source: Output kind
fr: Type de sortie

source: Define a title for our chat, only give the title without comments or explanations : user message : {user_prompt}. your answer: {assistant_response}
fr: Définis un titre pour notre conversation, donne seulement le titre sans faire de commentaires ou d'explications. voici le message que j'ai envoyé : {user_prompt}, voici ta réponse : {assistant_response}

source: Model
fr: Modèle

source: System prompt
fr: Prompt système

source: Define a title for our chat, only give the title without comments or explanations : user message : {user_prompt}
fr: Définis un titre pour notre conversation, donne seulement le titre sans faire de commentaires ou d'explications. voici le message que j'ai envoyé : {user_prompt}

source: Using %s model on replicate
fr: Utilisation du modèle %s sur Replicate

source: Extracting results
fr: Extraction des résultats

source: Replicate model
fr: Modèle Replicate

source: Model version
fr: Version du modèle

source: Title generation model
fr: Modèle de génération de titre

source: Create a search pipeline
fr: Création d'un pipeline de recherche

source: Allows to create pipeline that will help to search documents within a given namespace
fr: Permet de créer un pipeline qui va aider à rechercher des documents pour un namespace donné

source: Search %s
fr: Recherche %s

source: This pipeline will search documents or texts from %s namespace
fr: Ce pipeline va chercher des documents ou des textes provenant du namespace %s

source: Define a title for this message, only give the title without comments or explanations : user message : {user_prompt}
fr: Définis un titre pour ce message, donne seulement le titre sans faire de commentaires ou d'explications. voici le message : {user_prompt}

source: %s search
fr: Recherche %s

source: Using RAG
fr: Utilisation de RAG

source: Translate a text
fr: Traduis un texte

source: Translate a text using a neural network
fr: Traduis un texte à l'aide d'un réseau neuronal

source: %s Translation
fr: Traduction en %s

source: This pipeline will translate texts to %s
fr: Ce pipeline va traduire des textes en %s

source: %s translation
fr: traduction en %s

source: Starting translation to %s
fr: Début de la traduction en %s

source: Please translate this text to {language_label}. Do not add a title nor introduction nor explanations, only provide the translation. Here is the text to translate : {user_prompt}
fr: Merci de traduire ce texte en {language_label}. N'ajoute pas de titre, ni d'introduction, ni d'explication, contente toi de fournir la traduction. Voici le texte à traduire : {user_prompt}

source: Translation Model
fr: Modèle de traduction

source: Language
fr: Langage

source: %s must override a get_title method
fr: %s doit surcharger la méthode get_title

source: Type your request
fr: Saisissez votre requête

source: Get answers and solutions for your problems
fr: Obtenez des réponses à vos problèmes

source: Files
fr: Fichiers

source: Extract features from documents
fr: Extraction d'informations dans des documents

source: This helps to answers questions and extract informations after selecting some uploaded documents
fr: Ceci permet de répondre à des questions et d'extraire des informations après avoir sélectionné des documents uploadés

source: Informations extraction
fr: Extraction d'informations

source: Search failed
fr: La recherche a échoué

source: With following data : {output}
fr: Avec les données suivantes : {output}

source: Answer the following question: {prompt}
fr: Réponse à la question suivante : {prompt}

source: Executing AI with SearchWithUpload
fr: Lancement de l'IA avec SearchWithUpload

source: Ask questions on images
fr: Poser des questions sur des images

source: After uploading and checking some images, you can run text prompts on them, such as asking a description of those images
fr: Après l'upload et la sélection d'images, vous pouvez exécuter des prompts textes, par exemple demander une description de ces images

source: Image description
fr: Description d'images

source: Check some uploaded files then type your prompt. It will be used for each file
fr: Sélection des fichiers uploadés puis saisissez votre prompt, le prompt sera utilisé pour chaque fichier

source: Speech to text transcription
fr: Transcription parole vers texte

source: The following is a text transcription of an audio file, generate a title for this transcription : {text}
fr: Voici une transcription texte d'un fichier audio, génère un titre pour cette transcription : {text}

source: Audio to text transcription
fr: Transcription audio vers texte

source: <Audio file text transcription>
fr: <Transcription audio vers texte>

source: Negative Prompt
fr: Prompt négatif

source: Input Negative Prompt
fr: Entrée prompt négatif

source: Num. Outputs
fr: Nb de sorties

source: Number of images to output.
fr: Nombre d'images à générer.

source: Input image for img2img or inpaint mode
fr: Image d'entrée pour les modes img2img ou inpaint

source: Mask
fr: Masque

source: Input mask for inpaint mode. Black areas will be preserved,white areas will be inpainted.
fr: Masque d'entrée pour le mode inpaint. Les zones noires seront préservées, les zones blanches seront peintes.

source: Width
fr: Largeur

source: Width of output image
fr: Largeur de l'image de sortie

source: Height
fr: Hauteur

source: Height of output image
fr: Hauteur de l'image de sortie

source: High Noise Frac
fr: Fraction bruit haut

source: For expert_ensemble_refiner, the fraction of noise to use
fr: Fraction bruit haut pour le refiner expert_ensemble_refiner

source: Num. Inference Steps
fr: Nb d'étapes d'inférence

source: Number of inference steps
fr: Nombre d'étapes d'inférence

source: Guidance Scale
fr: Echelle de guidance

source: Scale for classifier-free guidance
fr: Echelle pour la guidance classifier-free

source: Use refine ?
fr: Utiliser refine ?

source: Random seed. Leave blank to randomize the seed
fr: Seed aléatoire. Laisser vide pour randomiser le seed

source: Scheduler
fr: Planificateur

source: Generate image with Stable Diffusion XL
fr: Générer une image avec Stable Diffusion XL

source: See more
fr: Voir plus

source: Your browser does not support the audio element.
fr: Votre navigateur ne supporte pas la balise audio.

source: Text transcription :
fr: Transcription texte :
